2.2.013/src/DataProcessors/МК_ОтправкаДокумента/МК_ОтправкаДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МК_ОтправкаДокумента</name>
</mdclass:DataProcessor>

2.2.013/src/Enums/МК_СтатусыДокументов/МК_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыДокументов</name>
  <enumValues>
    <name>С1</name>
  </enumValues>
  <enumValues>
    <name>С2</name>
  </enumValues>
  <enumValues>
    <name>С3</name>
  </enumValues>
  <enumValues>
    <name>С4</name>
  </enumValues>
  <enumValues>
    <name>С5</name>
  </enumValues>
  <enumValues>
    <name>С6</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Enums/МК_МаршрутыПодписания/МК_МаршрутыПодписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_МаршрутыПодписания</name>
  <enumValues>
    <name>М1</name>
  </enumValues>
  <enumValues>
    <name>М2</name>
  </enumValues>
  <enumValues>
    <name>М3</name>
  </enumValues>
  <enumValues>
    <name>М4</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ВидыДокументов/МК_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ВидыДокументов</name>
  <comment>Справочник видов электронных документов (связь со справочником МК)</comment>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВМояКоманда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМинтруда</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Списочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_СотрудникиКЭДО/МК_СотрудникиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_СотрудникиКЭДО</name>
  <comment>Сотрудники, присоединенные к КЭДО</comment>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСогласие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ВидыДокументовМояКоманда/МК_ВидыДокументовМояКоманда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ВидыДокументовМояКоманда</name>
  <comment>Копия справочника из облака</comment>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМинтруда</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ДокументыКЭДО/МК_ДокументыКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ДокументыКЭДО</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаДокумента</name>
    <comment>Код типа документа справочника в МояКоманда</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСсылка</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.МК_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученИзМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительФЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЭЦП</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьПодписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СотрудникиДокумента</name>
    <attributes>
      <name>СотрудникСсылка</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/DataProcessors/МК_ОтправкаДокумента/Forms/ОтправкаДокумента/Module.bsl
&НаСервере                                                   
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мСсылка = Параметры.мДок;                                         
	ЭтаФорма.ДокументСсылка = мСсылка;	 
	ЭтаФорма.МК_МенеджерПечати = Параметры.МК_МенеджерПечати;                            
	мДокумент = мСсылка.ПолучитьОбъект();	
	мТип = ТипЗнч(мСсылка); 
	мЗначение = Новый(мТип);
    ЭтаФорма.Документ = мЗначение.Метаданные().ПолноеИмя();   
	// Надо поискать документ в справочнике МК_ДокументыКЭДО. Возможно он уже создан. 
	// Чтобы искать, надо уже знать код типа документа МК, иначе для приема на работу неясно что искать - приказ или договор.
	мВидФормы = Параметры.ИменаМакетов; 
	мМногоСотрудников = Параметры.МК_МногоСотрудников;
	МК_Рекв = Справочники.МК_ВидыДокументов.МК_РеквВидаДокумента(ЭтаФорма.Документ,мВидФормы);	  // Возвращает соответствие МК_Код, МК_Наименование, МаршрутПодписания, КодМинтруда, Списочная? 
	мДКЭДО = НайтиДокКЭДО(мСсылка, МК_Рекв.Получить("МК_Код"));  
	ЭтаФорма.СоздаватьЭЦПНаСервере = Константы.СоздаватьЭлектронныеПодписиНаСервере.Получить();  
	ЭтаФорма.МК_Области = Параметры.МК_Области;
	
	//ЭтаФорма.ПечатнаяФорма - этот реквизит на сервере недоступен. Определяется при открытии на клиенте
	//ЭтаФорма.НомерДокумента = мДокумент.Номер;  // Номер и дату можно определить при открытии, когда узнаем код документа МК
	//ЭтаФорма.ДатаДокумента = мДокумент.Дата;   
	Если мДКЭДО = Неопределено ИЛИ (НЕ мДКЭДО.Отправлен) Тогда
		// Тут создание нового документа  
		Попытка
			ЭтаФорма.Организация = мДокумент.Организация;
		Исключение	 
			ЭтаФорма.Организация = мДокумент.ГоловнаяОрганизация;
		КонецПопытки;
		// В ЗУП руководитель - физлицо. А у нас - сотрудник.
		Попытка
			ЭтаФорма.РуководительФЛ = мДокумент.Руководитель;
		Исключение   
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СведенияОбОтветственныхЛицах") Тогда
				// Это запрос сведений о руководителе в ЗУП
				ЭтаФорма.РуководительФЛ = ЗарплатаКадры.ОтветственныеЛицаОрганизации(ЭтаФорма.Организация, "Руководитель", ТекущаяДатаСеанса()).Руководитель;
			Иначе 
				// А тут - для комплексной.  
				ЭтаФорма.РуководительФЛ = Обработки.МК_ВыгрузкаСотрудников.ПолучитьДанныеРуководителя(ЭтаФорма.Организация, ТекущаяДатаСеанса()).Руководитель;
			КонецЕсли;
		КонецПопытки;	
		мСписСотр = ОО.СписокСотрудниковПоФизлицу(ЭтаФорма.Организация,ЭтаФорма.РуководительФЛ);  // В этой функции подбираются только основные сотрудники или внешние
		Если мСписСотр.Следующий() Тогда                                                           // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
			ЭтаФорма.Руководитель = мСписСотр.СотрудникСсылка;                                     // возьмем первого.
		КонецЕсли;			
		//ЭтаФорма.КрайнийСрокПодписания = мДокумент.Дата+(60*60*24*3);  // Три дня
		ЭтаФорма.КрайнийСрокПодписания = ТекущаяДата()+(60*60*24*3);  // Три дня				
		мТЗ = ЭтаФорма.Протокол;  									
		Попытка     // Еще беда - в "отмене совмещения" нет Сотрудника, есть СовмещающийСотрудник  
			мСотрудник = мДокумент.Сотрудник;    
		Исключение	
			Попытка
				мСотрудник = мДокумент.СовмещающийСотрудник; 
			Исключение  
				Попытка 
					мСотрудник = мДокумент.ФизическиеЛица[0].ФизическоеЛицо;     
				Исключение 
					Попытка                                             
						// Тут видимо надо проверять: если документ списочный, то нужно всех сотрудников в этот список
						// записывать. Попутно проверять отношение к КЭДО.
						//                                                   
						Если Не мМногоСотрудников Тогда
							мСотрудник = мДокумент.Сотрудники[0].Сотрудник;  					  
						Иначе	
							Для Каждого мСотр Из мДокумент.Сотрудники Цикл    
								Если Справочники.МК_СотрудникиКЭДО.ПроверитьСогласиеКЭДО(мСотр.Сотрудник) Тогда	 				
						    		мНоваяСтрока = ЭтаФорма.Сотрудники.Добавить();
									мНоваяСтрока.Сотрудник = мСотр.Сотрудник;							
								Иначе									
									мСтр = мТЗ.Добавить();
									мСтр.ТабНом = СокрЛП(мСотр.Сотрудник.Код);
									мСтр.ФИО = мСотр.Сотрудник.Наименование;
									мСтр.Организация = СокрЛП(мСотр.Сотрудник.ГоловнаяОрганизация.Наименование);
								КонецЕсли;	
							КонецЦикла;	
						КонецЕсли;					
					Исключение    
						Попытка
							мСотрудник = мДокумент.Субъект;   // Это - "Согласие на обработку персональных данных"
						Исключение    
							Попытка      
								мСотрудник = мДокумент.Ссылка;   // Это - из справочника сотрудников							
							Исключение
							КонецПопытки;	
						КонецПопытки;	
					КонецПопытки	
				КонецПопытки;					
			КонецПопытки;	
		КонецПопытки;
		// В большинстве документов Сотрудник - это Сотрудник.Ссылка. Но есть и такие (пока обнаружен только приказ на отпуск 
		// по уходу за ребенком), где Сотрудник - ФизическоеЛицо.Ссылка   
		Если ТипЗнч(мСотрудник) = Тип("СправочникСсылка.ФизическиеЛица") Тогда   
			// Нужно найти сотрудника.
			мСписСотр = ОО.СписокСотрудниковПоФизлицу(мДокумент.Организация,мСотрудник);  // В этой функции подбираются только основные сотрудники или внешние
			Если мСписСотр.Следующий() Тогда                                              // совместители. Если все хорошо, вернется одна запись. Если больше - нас не волнует,
				мСотрудник = мСписСотр.СотрудникСсылка;                                   // возьмем первого.
			КонецЕсли;	
		КонецЕсли;      
		Если Не мМногоСотрудников Тогда
			НоваястрокаТЗ = ЭтаФорма.Сотрудники.Добавить();  
			НоваяСтрокаТЗ.Сотрудник = мСотрудник; 			
		КонецЕсли;	
		ЭтаФорма.Состояние = "Документ не создан";     
		ЭтаФорма.ЗапретДействий = Ложь;                            
	Иначе	                                         
		//мДКЭДО = мДКЭДОСсылка.ПолучитьОбъект();
		ЭтаФорма.Организация = мДКЭДО.ОрганизацияСсылка;      
		ЭтаФорма.Руководитель = мДКЭДО.Руководитель;   
		ЭтаФорма.РуководительФЛ = мДКЭДО.РуководительФЛ;   
		ЭтаФорма.КрайнийСрокПодписания =мДКЭДО.КрайнийСрокПодписания;		
		ЭтаФорма.НомерДокумента = мДКЭДО.НомерДокумента;
		ЭтаФорма.ДатаДокумента = мДКЭДО.ДатаДокумента;  
		ЭтаФорма.МК_Код = мДКЭДО.КодТипаДокумента; 
		ЭтаФорма.МаршрутПодписания = мДКЭДО.МаршрутПодписания;  
		ЭтаФорма.МК_Наименование =  Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID",ЭтаФорма.МК_Код);
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Для Каждого мСтр ИЗ мДКЭДО.СотрудникиДокумента Цикл      // Добавляем сотрудников
			мНоваяСтрока = ЭтаФорма.Сотрудники.Добавить();
			мНоваяСтрока.Сотрудник = мСтр.СотрудникСсылка;  
		КонецЦикла;		
		ЭтаФорма.ДокКЭДО = мДКЭДО;
		ЭтаФорма.Состояние = ПолучитьСостояниеДокумента(мДКЭДО);
		ЭтаФорма.ЗапретДействий = Истина;
	КонецЕсли; 
	
КонецПроцедуры       

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Если протокол "Не КЭДО" не пустой, то не надо открывать форму отправки, а надо показать список
	// сотрудников без КЭДО
	Если ЭтаФорма.Протокол.Количество() > 0 Тогда
		Отказ = Истина;   
		ТабДок = ДанныеТЗвТД();   
		Печать(ТабДок);
	Иначе	
		ЭтаФорма.ПечатнаяФорма = ЭтаФорма.ВладелецФормы.МК_ИмяФормы;
		// Теперь можно (нужно) получить еще и обычный маршрут подписания
		мРез = ОпределитьРеквизитыВидаДокумента();   // Это можно только на сервере  
		ЭтаФорма.УИД = ЭтаФорма.УникальныйИдентификатор;
		Если ЭтаФорма.ЗапретДействий Тогда		  
			Элементы.Группа3.Видимость = Ложь;                      
			Если ДокументОтправлен(ЭтаФорма.ДокКЭДО) Тогда
				Элементы.Отправить.Видимость = Ложь;
			КонецЕсли;
		Иначе
			Элементы.Удалить.Видимость = Ложь;		
			Элементы.Отправить.Видимость = Ложь;		
		КонецЕсли;
		// Если сотрудников много, и форма несписочная, нужно сформировать табличные документы из областей
		// существующего табличного документа, и сохранить их в хранилище. Таблица значений (список сотрудников)
		// формы при этом подменяется на другую - список сотрудников с документами, которые можно просматривать
		// и редактировать.
		Если ЭтаФорма.Сотрудники.Количество()>1 И (НЕ ЭтаФорма.МК_Списочный) Тогда
			мАдресДок = СоздатьФайлыНаСервере(ЭтаФорма.ВладелецФормы.ТекущаяПечатнаяФорма);		
			Элементы.Сотрудники.Видимость = Ложь;
			Элементы.ДокументыСотрудников.Видимость = Истина;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры                                              


&НаСервере
Функция ДанныеТЗвТД()	
	ТЗ = ЭтаФорма.Протокол.Выгрузить();
	ТабДок = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;  
	Построитель.ТекстЗаголовка = "Список сотрудников без согласия на участие в КЭДО. Нужно удалить их из этого документа, или обеспечить согласие.";
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);       
	Построитель.Вывести(ТабДок);
	Построитель.Выполнить();    
	Возврат ТабДок;
КонецФункции 

&НаКлиенте
Процедура Печать(ТабДок)
    // сформируем нужный нам табличный документ
	//    ТабДок = СформироватьТабДок();
    ТабДок.Область(1, , ТабДок.ВысотаТаблицы, ).Имя = "СписокCотрудниковБезСогласияКЭДО";
    // создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
    КПФ = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Протокол");    
	
	//ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Протокол"); 
    // Добавляем в коллекцию (тип массив) сформированный Табличный документ
    КПФ[0].ТабличныйДокумент = ТабДок;	
    
    КПФ[0].Экземпляров=1;
    КПФ[0].СинонимМакета = "Протокол";  // используется для формирования имени файла при сохранении из общей формы печати документов
    // .. и выводим стандартной процедурой БСП     
	
	ПараметрыВывода = УправлениеПечатьюКлиент.ПараметрыПечати(); 
	ПараметрыВывода.ЗаголовокФормы = "МояКоманда. Протокол проверки согласия на КЭДО сотрудников";    
	ПараметрыВывода.ВладелецФормы = ЭтаФорма;                                                        	
	Попытка
		УправлениеПечатьюКлиент.ПечатьДокументов(КПФ,Неопределено,ПараметрыВывода);
	Исключение  
		ПоказатьПредупреждение(,"Ошибка печати. Не удалось вывести список сотрудников без согласия на КЭДО.");
	КонецПопытки	
		
КонецПроцедуры



&НаСервере
Функция СоздатьФайлыНаСервере(мТД) 	
	мИндекс = 0;
	Для Каждого мОбласть Из ЭтаФорма.МК_Области Цикл
		мТабДок = мТД.ПолучитьОбласть(мОбласть);
		//мХранилище=Новый ХранилищеЗначения(мТабДок);
		мАдрес = ПоместитьВоВременноеХранилище(мТабДок, ЭтаФорма.УИД); 
		НоваяСтрока = ЭтаФорма.ДокументыСотрудников.Добавить();		
		НоваяСтрока.Сотрудник = ЭтаФорма.Сотрудники.Получить(мИндекс).Сотрудник;
		НоваяСтрока.АдресДокумента = мАдрес;
		мИндекс = мИндекс + 1;
	КонецЦикла;
	Возврат мАдрес;
КонецФункции	


Функция ПолучитьСостояниеДокумента(мДКЭДО)
	мВозврат = Неопределено;
	Если НЕ мДКЭДО.Отправлен Тогда
		Если ЗначениеЗаполнено(мДКЭДО.ИмяФайлаПодписи) Тогда
			мВозврат = "Документ создан. Подписан. Не отправлен";     
		Иначе	
			мВозврат = "Документ создан. Не подписан. Не отправлен";     
		КонецЕсли;	
	Иначе
		Если ЗначениеЗаполнено(мДКЭДО.ИмяФайлаПодписи) Тогда
			мВозврат = "Документ подписан и отправлен по маршруту";
		ИначеЕсли мДКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1 Тогда 
			мВозврат = "Документ отправлен как черновик";     
		Иначе	                                                   
			мВозврат = "Документ отправлен по маршруту";
		КонецЕсли;
	КонецЕсли;	            
	Возврат мВозврат;
КонецФункции	


//&НаКлиенте                                            
//Процедура ОтправитьФайлы(мРежим) 
//	Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда   
//		мМассивДокументов = Новый Массив;
//		мИменаМакетов = ЭтаФорма.ПечатнаяФорма;   
//		мМенеджерПечати = ЭтаФорма.МК_МенеджерПечати;
//		мПараметрыПечати = Новый Структура("ДополнитьКомплектВнешнимиПечатнымиФормами,РеквизитыДетализации",Ложь,"Сотрудник");     
//		мМассивОбъектов = Новый Массив;
//		Для Каждого мСтр Из ЭтаФорма.Сотрудники Цикл
//			//мМассивОбъектов = Новый Массив;
//			мМассивОбъектов.Добавить(мСтр.Сотрудник);
			//мАдресТабДок = СоздатьФайлыНаСервере(мМенеджерПечати, мИменаМакетов,мМассивОбъектов,мПараметрыПечати);	
			//мДок = Новый Структура("Сотрудник, Адрес",мСтр.Сотрудник,мАдресТабДок);
			//мМассивДокументов.Добавить(мДок);
			//мТабДок.Показать();
//		КонецЦикла;	                                                                                                    
//		мАдресТабДок = СоздатьФайлыНаСервере(мМенеджерПечати, мИменаМакетов,мМассивОбъектов,мПараметрыПечати);	
//		мПараметры = Новый Структура("НаименованиеДокумента, ДокументСсылка, МассивДокументов", ЭтаФорма.МК_Наименование, ЭтаФорма.ДокументСсылка,мМассивДокументов);
//		Оп = Неопределено; // Тут нужно оповещение описать
//		ОткрытьФорму("Обработка.МК_ОтправкаДокумента.Форма.СписокДокументов",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		//ОтправитьФайлыНаСервере();
//	Иначе	
//		ОтправитьФайл(мРежим);
//	КонецЕсли;	
//КонецПроцедуры     

//&НаСервере
//Функция СоздатьФайлыНаСервере(мМенеджерПечати, мИменаМакетов,мМассивОбъектов,мПараметрыПечати)
	// Нужно знать ИмяМакета (ИдентификаторПечатнойФормы), МенеджерПечати, МассивОбъектов (Сотрудники), ПараметрыПечати.
	//мМассивОбъектов.Добавить(ЭтаФорма.ДокументСсылка);
//	мПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(мМенеджерПечати, мИменаМакетов,мМассивОбъектов,мПараметрыПечати);	
//	мТабДок = мПечатныеФормы.КоллекцияПечатныхФорм.Получить(0).ТабличныйДокумент;    
	//мХранилище=Новый ХранилищеЗначения(мТабДок,);
//	мАдрес = ПоместитьВоВременноеХранилище(мТабДок, ЭтаФорма.УИД);    
//	Возврат мАдрес;
//КонецФункции	

&НаКлиенте                                            
//Процедура ОтправитьФайлы(мРежим) 
//	Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда       
		// Тут нужно отправлять файлы в цикле.
//		Для Каждого мСтрока Из ЭтаФорма.ДокументыСотрудников Цикл
//			ОтправитьФайл(мРежим,мСтрока);
//		КонецЦикла;	
//	Иначе
//		ОтправитьФайл(мРежим, Неопределено);
//	КонецЕсли;	
//КонецПроцедуры

&НаКлиенте                                            
Процедура ОтправитьФайл(мРежим)  
	Если ЭтаФорма.ЗапретДействий Тогда
		Возврат;    // Пока ничего не делаем, если ЗапретДействий.
	КонецЕсли;	
	мПарамПодписи = Неопределено;   
	//мОрг = Неопределено; 	
	мТабДок = Неопределено;
	мИдент = Неопределено;
	мНовыйУИД = Неопределено;
	Если ЭтаФорма.Сотрудники.Количество() = 1 ИЛИ МК_Списочный Тогда       
		мТабДок = ЭтаФорма.ВладелецФормы.ТекущаяПечатнаяФорма;	
		мНовыйУИД =  Новый УникальныйИдентификатор();
		мИдент = СокрЛП(мНовыйУИД);
	КонецЕсли;	
		
	// Сначала нужно записать новый документ в справочник. При этом сформируется UUID нового документа.
	// Его будем использовать в качестве имени файла. 	
	// мНовыйСсылка = МК_ДобавитьДокументКЭДО(мРежим); 
	// 19.12.24 Изменение поведения. Пока добавлять документ нежелательно, так как он может и не создаться/не подписаться
	// по разным причинам. Поэтому тут нужно застолбить UUID, с которым в случае удачи будет записан документ КЭДО	
	мОрг =ЭтаФорма.Организация;
	//Если мНовыйУИД <> Неопределено Тогда  		
		// Тут, если сказано подписать, надо открыть форму подписания. И дальше работать с выбранным сертификатом и паролем.
		Если мРежим = 3 Тогда			
			мПараметры = Новый Структура("ТабличныйДокумент,IDдокумента,НовыйУИД,ПараметрыПодписи,Организация",
									мТабДок,мИдент,мНовыйУИД,мПарамПодписи,мОрг) ; 				
			Оп = Новый ОписаниеОповещения("МК_ВыполнитьПослеОкончания", ЭтотОбъект); 
			ОткрытьФорму("Обработка.МК_ОтправкаДокумента.Форма.МК_ПодписаниеЭЦП",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе
			Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда       
				мРезультат = СоздатьPDFы(мРежим, мПарамПодписи);
			Иначе	
				мРезультат = СоздатьPDFНаСервере(мТабДок,мИдент,мРежим,мНовыйУИД,мПарамПодписи,Неопределено);	 
			КонецЕсли;	
			Если ЭтаФорма.ЗапретДействий Тогда		  
				Элементы.Группа3.Видимость = Ложь;
				Если ДокументОтправлен(ЭтаФорма.ДокКЭДО) Тогда
					Элементы.Отправить.Видимость = Ложь;
				Иначе	                                
					Элементы.Отправить.Видимость = Истина;
				КонецЕсли;                              
				Элементы.Удалить.Видимость = Истина;		
			Иначе
				Элементы.Удалить.Видимость = Ложь;		
				Элементы.Отправить.Видимость = Ложь;		
			КонецЕсли;
			ЭтаФорма.ОбновитьОтображениеДанных(); 
			//ОбновитьДинамическийСписок();  
			ОповеститьОбИзменении(ЭтаФорма.ДокументСсылка);
		КонецЕсли;	 
	//Иначе
	//	мРезультат = 0;   // Не удалось получить новый ГУИД. Так бывает?
	//КонецЕсли;	 
КонецПроцедуры  

&НаКлиенте                                            
Функция МК_ВыполнитьПослеОкончания(мПарам, мДопПарам) Экспорт	  // Сюда попадаем после получения реквизитов подписи.
	мСерверноеПодпиcание = ЭтаФорма.СоздаватьЭЦПНаСервере;
	Если мПарам = Неопределено Тогда                                                        
		мРезультат = Новый Массив(1); 
		мРезультат[0] = 6;
	Иначе		
		// Тут надо выполнить создание и подписание документа.     
		// Это - серверный способ подписания. Он нормально работает в файловой базе, но в клиент-серверной
		// надо, чтобы криптоменеджер был установлен на сервере. Пока такое не встречалось. Поэтому мСерверноеПодписание
		// буду нормально инициализировать позже.
		мРежим = 3;                                      
		мПарамПодписи = мПарам.ПараметрыПодписи;  
		мТАбДок = мПарам.ТабДок;
		мИдент = мПарам.IDДокумента;								
		мНовыйСсылка = мПарам.СсылкаНаДокумент;        
		мПарамПодписи = мПарам.ПараметрыПодписи;
		Если мСерверноеПодпиcание Тогда                                    
			Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда       
				мРезультат = СоздатьPDFы(мРежим, мПарамПодписи);
			Иначе	                 	
				мНовыйУИД = мПарам.НовыйУИД;    
				мРезультат = СоздатьPDFНаСервере(мТабДок,мИдент,мРежим,мНовыйУИД,мПарамПодписи,Неопределено);	 
			КонецЕсли;				
		Иначе          			
			// Надо создать PDF файл на сервере и передать сюда через временное хранилище.      
			// Здесь для множественных документов нужно организовывать цикл.          
			Если ЭтаФорма.Сотрудники.Количество() > 1 И (Не МК_Списочный) Тогда       
				СоздатьPDFыДляКлиента();    // Все новые данные пишутся в таблицу "ДокументыСотрудников" 
				мРез = ПодписатьДокументыНаКлиенте(мПарамПодписи,мПарам.МенеджерКрипты);   
				
				Если мРез = Ложь Тогда   // Это значит, что подписание обломалось совсем.
				Иначе
					ЗаписатьиОтправитьКомплекты(мПарамПодписи);
				КонецЕсли;	
			Иначе	
				мРез = СоздатьPDFНаСервереДляКлиента(мТабДок,мИдент,Неопределено); 
				Если мРез[0] = 1 Тогда  
					// Теперь надо подписать.
					мРезультат = ПодписатьДокументНаКлиенте(мРез[1],мПарамПодписи,мПарам.МенеджерКрипты);  
					Если мРезультат = Неопределено Тогда  // Это может быть, если МенеджерКриптографии не создался
					ИначеЕсли мРезультат.Успешно Тогда
						// Тут имеем во временном хранилище PDF и в структуре мРезультат - двоичные данные подписи.
						// Надо опять делать серверный вызов, там сохранять документ и подпись в файлы, архивировать и отправлять
						мРезультат = ЗаписатьИОтправитьКомплект(мРез[1],мРезультат.Подпись,мИдент,мПарамПодписи,мРежим,мНовыйСсылка, Неопределено);  
					Иначе  // Подписание обломалось
						Сообщить(мРезультат.ТекстОшибки);
					КонецЕсли;	
				КонецЕсли;		
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	  
	Если ЭтаФорма.ЗапретДействий Тогда		  
		Элементы.Группа3.Видимость = Ложь;
		Если ДокументОтправлен(ЭтаФорма.ДокКЭДО) Тогда
			Элементы.Отправить.Видимость = Ложь;   
		Иначе	                                
			Элементы.Отправить.Видимость = Истина;
		КонецЕсли;                              
		Элементы.Удалить.Видимость = Истина;			
	Иначе
		Элементы.Удалить.Видимость = Ложь;		
		Элементы.Отправить.Видимость = Ложь;		
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных(); 
	ОповеститьОбИзменении(ЭтаФорма.ДокументСсылка);
	//ОбновитьДинамическийСписок();
КонецФункции	


&НаСервере
Функция МК_ДобавитьДокументКЭДО(мРежим,мНовыйУИД,мСотрудник)
	мИдент = Неопределено;
	//МК_Код = Справочники.МК_ВидыДокументов.МК_РеквВидаДокумента(ЭтаФорма.Документ,ЭтаФорма.ПечатнаяФорма);
	Если ЗначениеЗаполнено(ЭтаФорма.МК_Код) Тогда                    
		НовыйЭлемент = Справочники.МК_ДокументыКЭДО.СоздатьЭлемент();
		мСсылка = Справочники.МК_ДокументыКЭДО.ПолучитьСсылку(мНовыйУИД);
		НовыйЭлемент.УстановитьСсылкуНового(мСсылка); 	
		НовыйЭлемент.ДокументОснование = ЭтаФорма.ДокументСсылка;
		НовыйЭлемент.Наименование = ЭтаФорма.Документ;
		НовыйЭлемент.КодТипаДокумента = ЭтаФорма.МК_Код;
		НовыйЭлемент.ОрганизацияСсылка = ЭтаФорма.Организация;
		НовыйЭлемент.НомерДокумента = ЭтаФорма.НомерДокумента;
		//НовыйЭлемент.ДатаДокумента = ЭтаФорма.ДатаДокумента;
		НовыйЭлемент.ДатаДокумента = УниверсальноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса());
		НовыйЭлемент.МаршрутПодписания = ЭтаФорма.МаршрутПодписания;
		НовыйЭлемент.КрайнийСрокПодписания = ЭтаФорма.КрайнийСрокПодписания; 
		НовыйЭлемент.Руководитель = ЭтаФорма.Руководитель;
		НовыйЭлемент.РуководительФЛ = ЭтаФорма.РуководительФЛ;
		НовыйЭлемент.ТипФормы = ЭтаФорма.ПечатнаяФорма;
		Если мРежим = 1 Тогда
			НовыйЭлемент.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1;  // Черновик 
			НовыйЭлемент.СтатусЧислом = 1;
		Иначе	                                                                             
			НовыйЭлемент.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С2;  // На подписании
			НовыйЭлемент.СтатусЧислом = 1;
		КонецЕсли;
		НовыйЭлемент.Отправлен = Ложь; 					// На момент создания документа, он не отправлен.   
		Если мСотрудник = Неопределено Тогда
			Для Каждого мСтр ИЗ ЭтаФорма.Сотрудники Цикл      // Добавляем сотрудников
				мСтрДок = НовыйЭлемент.СотрудникиДокумента.Добавить();
				мСтрДок.СотрудникСсылка = мСтр.Сотрудник;
			КонецЦикла;	
		Иначе
			мСтрДок = НовыйЭлемент.СотрудникиДокумента.Добавить();
			мСтрДок.СотрудникСсылка = мСотрудник;
		КонецЕсли;	
		НовыйЭлемент.Записать();   
		// Нужно определить статус документа и код статуса - для регистра
		мИдент = НовыйЭлемент.Ссылка;	 		
		ЭтаФорма.ДокКЭДО = мИдент;
	КонецЕсли;	                                                       
	Возврат мИдент;
КонецФункции 

Функция СоздатьPDFы(мРежим,мПарамПодписи)      // Здесь в цикле будут создаваться множественные документы  
	мРезультат = Неопределено;   // Что-то нужно будет вернуть
    Для Каждого мСтрока Из ЭтаФорма.ДокументыСотрудников Цикл
		мНовыйУИД =  Новый УникальныйИдентификатор();  
		мИдент = СокрЛП(мНовыйУИД);
		мАдрес = мСтрока.АдресДокумента;
		мТабДок = ПолучитьИзВременногоХранилища(мАдрес); 
		мСотрудник = мСтрока.Сотрудник;
		мРез = СоздатьPDFНаСервере(мТабДок,мИдент,мРежим,мНовыйУИД,мПарамПодписи,мСотрудник);	 
		// Тут нужно отразить результат по документу в таблице
	КонецЦикла;
	Возврат мРезультат;
КонецФункции	


Функция СоздатьPDFНаСервере(мДокумент,мИдент,мРежим,мНовыйУИД,мПарамПодписи,мСотрудник);  
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мВозврат = Новый Массив;
	мВозврат.Добавить(1);  // Все хорошо   
	Если мСотрудник = Неопределено Тогда
		мСотр = ЭтаФорма.Сотрудники[0].Сотрудник;
	Иначе
		мСотр = мСотрудник;
	КонецЕсли;	
	мДок = ЭтаФорма.Документ;       
	мИмяФайла = мСотр.ФизическоеЛицо.Фамилия + "_" + мСотр.ФизическоеЛицо.Инициалы + "_Документ_№"+ ЭтаФорма.НомерДокумента+"_от_"+Формат(ЭтаФорма.ДатаДокумента, "ДФ=гггг-ММ-дд; ДП=");   
	мИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(мИмяФайла,"_");
	мИмяФайла = СтрЗаменить(СокрЛП(мИмяФайла),".","");
	// Теперь создаем каталоги правильно.
	мВремДир = ФайловаяСистема.СоздатьВременныйКаталог();  
	мДирДок = мВремДир + мИдент + ПолучитьРазделительПутиСервера();    // Папка для файлов документа. В ней будут: основной PDF-файл, xml-файл описание, потом подписи, МЧД и т.д.
	СоздатьКаталог(мДирДок);   

	ИмяPDF = мДирДок+ мИмяФайла + ".pdf";  	 	
	Попытка                               	   
		мДокумент.Записать(ИмяPDF, ТипФайлаТабличногоДокумента.PDF_A_1);  		
	Исключение   
		мВозврат[0] = 2  // Не удалось создать PDF-файл
	КонецПопытки;	
	
	
	мРез = Истина;                  
	мИмяФайлаПодписи = Неопределено;
	Если мВозврат[0] = 1 И мРежим = 3 Тогда  // Если файл создался и режим с подписью, надо подписать.   
		// Для этого нужно открыть форму подписания.
		мОшибкаПодписи = МК_ПодписатьЭЦП(ИмяPDF,мДирДок,мПарамПодписи);  
		Если мОшибкаПодписи = Неопределено Тогда        
			мИмяФайлаПодписи = ЭтаФорма.ИмяФайлаПодписи;
		Иначе	
			мВозврат[0] = 6;  
			мВозврат.Добавить(мОшибкаПодписи);
			мРез = Ложь;
		КонецЕсли;	
	КонецЕсли;    	
	
    Если мВозврат[0]=1 Тогда    
		// Опять возвращаемся к идее создания zip-архива для каждого документа.
		Попытка
			ИмяАрхива = мВремДир + мИдент + ".zip";
			мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Документ КЭДО",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);     
			мФайлы = мДирДок + "*.*";                                                                                                           
			мАрхив.Добавить(мФайлы);
			мАрхив.Записать();    
		Исключение                                         
			мВозврат[0] = 3  // Не удалось создать ZIP-файл
		КонецПопытки;	 
	КонецЕсли;                                                      	
	ПродолжитьОтправкуФайла(мВозврат,ИмяАрхива,мРежим,мИмяФайла, мНовыйУИД, мСотрудник);	
	УдалитьФайлы(мВремДир);
КонецФункции	                                                    


Функция ПродолжитьОтправкуФайла(мВозврат,ИмяАрхива,мРежим,мИмяФайла,мНовыйУИД,мСотрудник)
	// Вот тут zip-файл уже создан. Надо создать запись для него в справочнике документов КЭДО.     
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();
	Если мВозврат[0] = 1 Тогда
		мНовыйСсылка = МК_ДобавитьДокументКЭДО(мРежим,мНовыйУИД,мСотрудник); 
		мДокКЭДО = мНовыйСсылка.ПолучитьОбъект();        
		мДокКЭДО.ИмяФайлаДокумента = мИмяФайла+".pdf";      
		мДокКЭДО.ИмяФайлаПодписи = ЭтаФорма.ИмяФайлаПодписи;
		мДокКэдо.ВладелецЭЦП = ЭтаФорма.ВладелецЭЦП; 
		мДокКЭДО.ДатаПодписи = УниверсальноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса());   
		мДокКЭДО.МЧД = ЭтаФорма.МЧД;
    	мДокКЭДО.Записать();
		
		// Сохраним файл в присоединенных файлах. !!! 18.08.2025 Отключаем работу с присоединенными файлами - Фреш пока ее не поддерживает.
		//Попытка
		//	мФайл = Новый Файл(ИмяАрхива);	
		//	мДвоичДан = Новый ДвоичныеДанные(ИмяАрхива);
		//	мВрХр = ПоместитьВоВременноеХранилище(мДвоичДан);
		//	// Подготоваливаем описание файла заполнив все необходимые параметры
		//	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		//	ПараметрыФайла.Автор = Пользователи.ТекущийПользователь();
		//	ПараметрыФайла.ВладелецФайлов = мНовыйСсылка;         
		//	ПараметрыФайла.Вставить("Владелец",мНовыйСсылка);
		//	ПараметрыФайла.ИмяБезРасширения = мФайл.ИмяБезРасширения; //  СтрЗаменить(ИмяАрхива,".zip","");
		//	ПараметрыФайла.РасширениеБезТочки = "zip"; 			
		//	// Используем функцию БСП и добавляем файл к объекту
		//	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, мВрХр);   		
		//Исключение
		//	мВозврат[0] = 8  // Не удалось записать присоединенный файл
		//КонецПопытки;
	
	
		// Тут - отправка. 
		Если мВозврат[0] = 1 Тогда 
			мСеанс = ОО.СоздатьСеансСвязи(Истина);
			Если мСеанс = Неопределено Тогда
				// Ошибка авторизации. Ничего не отправляем. 
				мВозврат[0] = 4;
				мРезультат = Ложь;
			Иначе
				мРезультат = ОО.ВыгрузитьФайлНаСайт(ИмяАрхива,мСеанс,"pdf",Истина,"api/1c-exchange/edms/documents/upload","Документы КЭДО");
				Если НЕ мРезультат Тогда
					мВозврат[0] = 5      // Ошибка отправки файла 
				КонецЕсли;	
			КонецЕсли;
    	КонецЕсли;
	КонецЕсли;
	Если мВозврат[0] = 1 Тогда   // Все удалось. Нужно отправить json описание файла.
		мДокументы = Новый Массив;
		мДокументы.Добавить(мНовыйСсылка);
		мРезультат = Справочники.МК_ДокументыКЭДО.МК_ОтправитьJSON(мДокументы);
		Если НЕ мРезультат Тогда
			мВозврат[0]=7; //  Ошибка отправки описания файла.
		КонецЕсли;	
	КонецЕсли;
	мСтатус = "";   
	мКодСтатуса = 1;
	Если мВозврат[0] = 1 Тогда
		Сообщить("Документ отправлен успешно");  
		Если мДокКЭДО.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С1 Тогда;  // Черновик			
			мСтатус = "Отправлен как черновик";   
			мКодСтатуса = 3;			
		Иначе
			мСтатус = "На подписании";  
			мКодСтатуса = 4;			
		КонецЕсли;
	ИначеЕсли мВозврат[0] = 5 Тогда
		Сообщить("Ошибка отправки zip-архива");		
		мСтатус = "Не отправлен";  		
	ИначеЕсли мВозврат[0] = 7 Тогда
		Сообщить("Ошибка отправки описания файла");				
	ИначеЕсли мВозврат[0] = 4 Тогда
		Сообщить("Ошибка авторизации. Ничего не отправлено");			
	//ИначеЕсли мВозврат[0] = 8 Тогда
	//	Сообщить("Ошибка. Не удалось записать присоединенный файл");
	ИначеЕсли мВозврат[0] = 3 Тогда
		Сообщить("Ошибка. Не удалось создать zip-архив");			
	ИначеЕсли мВозврат[0] = 6 Тогда
		Сообщить("Ошибка формирования электронной подписи: "+ мВозврат[1]); //мОшибкаПодписи);
	ИначеЕсли мВозврат[0] = 2 Тогда
		Сообщить("Ошибка создания pdf-файла");	
	КонецЕсли;    
	Если мВозврат[0] =1 ИЛИ мВозврат[0] = 4 ИЛИ мВозврат[0] = 5 ИЛИ мВозврат[0] = 7 Тогда  // 5 или 7 - это все сделано, но не удалось отправить zip-архив или описание.
		ЭтаФорма.Состояние = ПолучитьСостояниеДокумента(мНовыйСсылка);
		ЭтаФорма.ТолькоПросмотр = Истина;    
		ЭтаФорма.ЗапретДействий = Истина;
		// При записи нового элемента нужно заполнить для него сведения в регистре сведений "МК_СостояниеДокументовКЭДО"
		Если мКодСтатуса = 1 И ЗначениеЗаполнено(мДокКЭДО.ИмяФайлаПодписи) ТОгда
			мКодСтатуса = 2;
			мСтатус = "Подписан, не отправлен";
		КонецЕсли;	
		Справочники.МК_ДокументыКЭДО.ОтразитьВРегистре(мДокКЭДО.ДокументОснование,мНовыйСсылка,мДокКЭДО.КодТипаДокумента,мСтатус,мКодСтатуса);
	КонецЕсли;	  	
КонецФункции   

Функция МК_ПодписатьЭЦП(ИмяPDF,мДирДок,мПарамПодписи)
	//мРез = Истина;
	мРез = Неопределено;
	Попытка    	
		мДСерт = мПарамПодписи.Сертификат.СертификатЭЦП.ДанныеСертификата.Получить();
		мСертификат = Новый СертификатКриптографии(мДСерт);	
		мПрограмма = мПарамПодписи.Сертификат.СертификатЭЦП.Программа;
		мМК = ПолучитьМенеджерКриптографии("Подписание",мПрограмма);
    	мМК.ПарольДоступаКЗакрытомуКлючу = мПарамПодписи.Пароль; // строка     
		// Тут надо вычислить имя файла-подписи. 1С дублирует его из имени pdf-файла, а МК хочет видеть в имени владельца
		// подписи.                                                         
		мНаимДок = СтрЗаменить(СокрЛП(ЭтаФорма.МК_Наименование), " ","_");	
		// Сначала ФИО владельца ЭЦП.
		мИмяПодписи = СокрЛП(мПарамПодписи.ФизЛицо.Фамилия) + "_"+ 
		                 СокрЛП(мПарамПодписи.ФизЛицо.Имя) + "_"+  
						    СокрЛП(мПарамПодписи.ФизЛицо.Отчество)+"_"+мНаимДок + ".sig"; 			
   		мМК.Подписать(ИмяPDF, мДирДок+мИмяПодписи, мСертификат);  
		ЭтаФорма.ВладелецЭЦП = мПарамПодписи.ФизЛицо; 
		ЭтаФорма.ИмяФайлаПодписи = мИмяПодписи;
	Исключение   	
		мОшибка = ИнформацияОбОшибке();  
		мРез = ПодробноеПредставлениеОшибки(мОшибка);
	КонецПопытки;	
	Возврат мРез;
КонецФункции	           

Функция ПолучитьМенеджерКриптографии(Операция = "", Программа = Неопределено)
		
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		МодульЭлектроннаяПодпись = ОбщегоНазначения.ОбщийМодуль("ЭлектроннаяПодпись"); 
		ОписаниеОшибки = "";
		мРез = МодульЭлектроннаяПодпись.МенеджерКриптографии(Операция,,ОписаниеОшибки, Программа);
		Возврат мРез;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СоздатьPDFыДляКлиента()    // Создавать документы будем сразу для всех сотрудников.
	// мСписок = Новый Массив;  
	// Сохраняем адреса документов в таблице значений "ДокументыСотрудников
	Для Каждого мСтрока Из ЭтаФорма.ДокументыСотрудников Цикл      		
		мСтрока.УИД =  Новый УникальныйИдентификатор();  
		мСтрока.Идентификатор = СокрЛП(мСтрока.УИД);
		мАдрес = мСтрока.АдресДокумента;
		мТабДок = ПолучитьИзВременногоХранилища(мАдрес); 
		мСотрудник = мСтрока.Сотрудник;		
		мРез = СоздатьPDFНаСервереДляКлиента(мТабДок,мСтрока.Идентификатор, мСотрудник); 		                        
		
		Если мРез.Количество() > 1 Тогда
			мСтрока.АдресPDF = мРез[1];
		Иначе	        
			мСтрока.АдресPDF = Неопределено; 
			мСтрока.Ошибка = Истина;
			мСтрока.ОписаниеОшибки = "Не удалось создать PDF-файл";
		КонецЕсли;	    	
	КонецЦикла;	
	//Возврат мСписок;	
КонецФункции	

Функция СоздатьPDFНаСервереДляКлиента(мТабДок,мИдент, мСотрудник); 
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мВозврат = Новый Массив;
	мВозврат.Добавить(1);  // Все хорошо  
	Если мСотрудник = Неопределено Тогда
		мСотр = ЭтаФорма.Сотрудники[0].Сотрудник;
	Иначе
		мСотр = мСотрудник;
	КонецЕсли;	
	мДок = ЭтаФорма.Документ;       
	мИмяФайла = мСотр.ФизическоеЛицо.Фамилия + "_" + мСотр.ФизическоеЛицо.Инициалы + "_Документ_№"+ ЭтаФорма.НомерДокумента+"_от_"+Формат(ЭтаФорма.ДатаДокумента, "ДФ=гггг-ММ-дд; ДП=");   
	мИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(мИмяФайла,"_");
	мИмяФайла = СтрЗаменить(СокрЛП(мИмяФайла),".","");
	// Теперь создаем каталоги правильно.
	мВремДир = ФайловаяСистема.СоздатьВременныйКаталог();  
	мДирДок = мВремДир + мИдент + ПолучитьРазделительПутиСервера();    // Папка для файлов документа. В ней будут: основной PDF-файл, xml-файл описание, потом подписи, МЧД и т.д.
	СоздатьКаталог(мДирДок);    
		
	ИмяPDF = мДирДок+ мИмяФайла + ".pdf";  	 	
	Попытка                               	   
		мТабДок.Записать(ИмяPDF, ТипФайлаТабличногоДокумента.PDF_A_1);  	
		мФайл = Новый Файл(ИмяPDF);	
		мДвоичДан = Новый ДвоичныеДанные(ИмяPDF);
		мВрХр = ПоместитьВоВременноеХранилище(мДвоичДан,ЭтаФорма.УИД);
		мВозврат.Добавить(мВрХр);
	Исключение   
		мВозврат[0] = 2  // Не удалось создать PDF-файл    
	КонецПопытки;   
	УдалитьФайлы(мВремДир); 
	Возврат мВозврат;	
КонецФункции	

&НаКлиенте
Функция ПодписатьДокументНаКлиенте(АдресВХ, мПарамПодписи, мМК)  Экспорт		
	мРез = Новый Структура("Успешно,Подпись,ТекстОшибки",Истина);
	
	Если ТипЗнч(мМК) = Тип("Строка") Тогда
		ПоказатьПредупреждение(, мМК);
		Возврат Неопределено;
	КонецЕсли;

	мДанныеДокумента = ПолучитьИзВременногоХранилища(АдресВХ);
		
	Если ЗначениеЗаполнено(мПарамПодписи.Пароль) Тогда                    
		мМК.ПарольДоступаКЗакрытомуКлючу = мПарамПодписи.Пароль; // строка		
	КонецЕсли;
	
	ПотокВПамяти = Новый ПотокВПамяти;     	
	мДСерт = ПолучитьДанныеСертификата(мПарамПодписи.Сертификат);
	мСертификат = Новый СертификатКриптографии(мДСерт);	
	
	Попытка
		мМК.Подписать(мДанныеДокумента,ПотокВПамяти,мСертификат);
		мРез.Подпись = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные(); 		
	Исключение
		мРез.Успешно = Ложь;
		мРез.ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;  
	Возврат мРез;  
КонецФункции    

&НаКлиенте
Функция ПодписатьДокументыНаКлиенте(мПарамПодписи,мМК)  	// Работаем с таблицей "ДокументыСотрудников	
	Если ТипЗнч(мМК) = Тип("Строка") Тогда                  
		ПоказатьПредупреждение(, мМК);
		Возврат Ложь;    // Это значит, что подписание обломалось совсем
	КонецЕсли;

	Если ЗначениеЗаполнено(мПарамПодписи.Пароль) Тогда                    
		мМК.ПарольДоступаКЗакрытомуКлючу = мПарамПодписи.Пароль; // строка		
	КонецЕсли;
	
	мДСерт = ПолучитьДанныеСертификата(мПарамПодписи.Сертификат);
	мСертификат = Новый СертификатКриптографии(мДСерт);	

	Для Каждого мСтрока Из ЭтаФорма.ДокументыСотрудников Цикл
		//мРез = Новый Структура("Успешно,Подпись,ТекстОшибки",Истина);
	
		мДанныеДокумента = ПолучитьИзВременногоХранилища(мСтрока.АдресPDF);            	
		ПотокВПамяти = Новый ПотокВПамяти;     	
		Попытка
			мМК.Подписать(мДанныеДокумента,ПотокВПамяти,мСертификат);
			мПодпись = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();   
			//мХранилище=Новый ХранилищеЗначения();
			мСтрока.АдресПодписи = ПоместитьВоВрХр(мПодпись, ЭтаФорма.УИД); 
		Исключение
			мСтрока.Ошибка = Истина;
			мСтрока.ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки; 		
	КонецЦикла;	
	Возврат Истина;
КонецФункции    

&НаСервереБезКонтекста
Функция ПоместитьВоВрХр(мПодпись, мУИД)  
	Возврат ПоместитьВоВременноеХранилище(мПодпись,мУИД);
КонецФункции
	

Функция ЗаписатьиОтправитьКомплекты(мПарамПодписи)   // Работаем с таблицей "ДокументыСотрудников	
	Для Каждого мСтрока Из ЭтаФорма.ДокументыСотрудников Цикл
		Если мСтрока.Ошибка = Ложь Тогда
			мРежим = 3;   // Подписать и отправить  
			мПодпись = ПолучитьИзВременногоХранилища(мСтрока.АдресПодписи);
			мРез = ЗаписатьИОтправитьКомплект(мСтрока.АдресPDF,мПодпись,мСтрока.Идентификатор,мПарамПодписи,мРежим,мСтрока.Уид, мСтрока.Сотрудник);
			мОшибка = Неопределено;
			Если мРез[0] = 2 Тогда       
				мОшибка = "Не удалось создать PDF-файл";
			ИначеЕсли мРез[0] = 6 Тогда       			    
				мОшибка = "Ошибка сохранения подписи";  
			ИначеЕсли мРез[0] = 3 Тогда      			    
				мОшибка = "Не удалось создать ZIP-файл";
			КонецЕсли;
			Если мОшибка <> Неопределено Тогда
				мСтрока.ОписаниеОшибки = мОшибка;
				мСтрока.Ошибка = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецФункции	

&НаСервере
Функция ЗаписатьИОтправитьКомплект(АдресФайла,мПодпись,мИдент,мПарамПодписи,мРежим,мНовыйУид, мСотрудник)
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мВозврат = Новый Массив;
	мВозврат.Добавить(1);  // Все хорошо
	Если мСотрудник = Неопределено Тогда
		мСотр = ЭтаФорма.Сотрудники[0].Сотрудник;
	Иначе
		мСотр = мСотрудник;
	КонецЕсли;	
	мДок = ЭтаФорма.Документ;       
	мИмяФайла = мСотр.ФизическоеЛицо.Фамилия + "_" + мСотр.ФизическоеЛицо.Инициалы + "_Документ_№"+ ЭтаФорма.НомерДокумента+"_от_"+Формат(ЭтаФорма.ДатаДокумента, "ДФ=гггг-ММ-дд; ДП=");   
	мИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(мИмяФайла,"_");
	мИмяФайла = СтрЗаменить(СокрЛП(мИмяФайла),".","");
	// Теперь создаем каталоги правильно.
	мВремДир = ФайловаяСистема.СоздатьВременныйКаталог();  
	мДирДок = мВремДир + мИдент + ПолучитьРазделительПутиСервера();    // Папка для файлов документа. В ней будут: основной PDF-файл, xml-файл описание, потом подписи, МЧД и т.д.
	СоздатьКаталог(мДирДок);    
		
	ИмяPDF = мДирДок+ мИмяФайла + ".pdf";  	 	              
	мДанныеДокумента = ПолучитьИзВременногоХранилища(АдресФайла);
	Попытка
		мДанныеДокумента.Записать(ИмяPDF);
	Исключение
		мВозврат[0] = 2  // Не удалось создать PDF-файл
	КонецПопытки;
	Если мВозврат[0] = 1 Тогда
		// Теперь подпись
		мНаимДок = СтрЗаменить(СокрЛП(ЭтаФорма.МК_Наименование), " ","_");	
		// Сначала ФИО владельца ЭЦП.
		мИмяПодписи = СокрЛП(мПарамПодписи.ФизЛицо.Фамилия) + "_"+ 
	                 СокрЛП(мПарамПодписи.ФизЛицо.Имя) + "_"+  
					    СокрЛП(мПарамПодписи.ФизЛицо.Отчество)+"_"+мНаимДок + ".sig"; 			
		Попытка						
			мПодпись.Записать(мДирДок+мИмяПодписи);  					
		Исключение     
			мВозврат[0] = 6; // Ошибка сохранения подписи
		КонецПопытки;
		
   		ЭтаФорма.ВладелецЭЦП = мПарамПодписи.ФизЛицо; 
		ЭтаФорма.ИмяФайлаПодписи = мИмяПодписи; 
		ЭтаФорма.МЧД = мПарамПодписи.МЧД;
		Если ЗначениеЗаполнено(ЭтаФорма.МЧД) Тогда  // Если есть МЧД, нужно получить ее xml-файл и записать во временный каталог
			мФайлыМЧД = ПолучитьФайлыМЧД(ЭтаФорма.МЧД);  // Получается массив файлов: МЧД и подпись к ней (если есть). В массиве колонки: ИмяФайла, ТипФайла, ДвоичныеДанные, ОписаниеОшибки   
			Если мФайлыМЧД = Неопределено Тогда
				// Пока не знаю, что делать
			Иначе     
				Попытка  
					Для Каждого мФайлМЧД Из мФайлыМЧД Цикл  
						мФайл11 = мДирДок+мФайлМЧД.ИмяФайла;
						мФайлМЧД.ДвоичныеДанные.Записать(мФайл11);
					КонецЦикла;						
				Исключение   
					мВозврат[0] = 6; // Ошибка сохранения подписи (МЧД связана с подписью, поэтому пока в отдельную ошибку не буду выделять).	
				КонецПопытки;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;   
	Если мВозврат[0] = 1 Тогда      
		Попытка
			ИмяАрхива = мВремДир + мИдент + ".zip";
			мАрхив = Новый ЗаписьZipФайла(ИмяАрхива,"", "Документ КЭДО",МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный, МетодШифрованияZIP.Zip20);     
			мФайлы = мДирДок + "*.*";                                                                                                           
			мАрхив.Добавить(мФайлы);
			мАрхив.Записать();    
		Исключение                                         
			мВозврат[0] = 3  // Не удалось создать ZIP-файл
		КонецПопытки;
	КонецЕсли;	                                                           	
	ПродолжитьОтправкуФайла(мВозврат,ИмяАрхива,мРежим,мИмяФайла, мНовыйУИД, мСотрудник);
	УдалитьФайлы(мВремДир); 
	Возврат мВозврат;
КонецФункции

&НаСервере
Функция ПолучитьФайлыМЧД(мМЧД); 
	мАрхивМЧД = Неопределено;
	мВозврат = 1;
	мФайлы = Новый Массив;       	
	Доверенности = Новый Массив;
	Доверенности.Добавить(мМЧД);
	ДляНалоговыхОрганов = Ложь;
	//РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(мМЧД, мФайлы);   
	//мФайлы = МашиночитаемыеДоверенностиФНССлужебныйВызовСервера.ФайлыДоверенностей(Доверенности, ДляНалоговыхОрганов);   	 
	Модуль = ОбщегоНазначения.ОбщийМодуль("МашиночитаемыеДоверенностиФНС");                         
	мФайлы = Модуль.ФайлыДоверенностей(Доверенности, ДляНалоговыхОрганов); 
	Для Каждого мЭлемент Из мФайлы Цикл
		мФайлыМЧД = мЭлемент.Значение;
	КонецЦикла;	
	//Если мФайлы.Количество()>0 Тогда
	//	мАрхивМЧД = мФайлы[0].Значение;
	//КонецЕсли;
	Возврат мФайлыМЧД;      // Это описание ZIP-архива доверенности. Содержит имя и адрес в хранилище
КонецФункции
                    
&НаСервереБезКонтекста
Функция ПолучитьДанныеСертификата(мСерт)
	мДСерт = мСерт.СертификатЭЦП.ДанныеСертификата.Получить();
	Возврат мДСерт;
КонецФункции	


Функция ОписаниеВыводимогоФайла()
	
	ОписаниеФайла = Новый Структура(
		"Ссылка,
		|ИмяФайлаСРасширением,
		|АдресВоВременномХранилище,
		|Кодировка,
		|ИдентификаторПечатнойФормы,
		|ФизическоеЛицо,
		|Владелец,
		|Комментарий,
		|Размер,
		|ИмяФайлаБезРасширения,
		|РасширениеФайла,
		|Номер,
		|Дата,
		|Название");
	
	ОписаниеФайла.Комментарий = "";
	ОписаниеФайла.Размер = 0;
	
	Возврат ОписаниеФайла;
	
КонецФункции

Процедура ВывестиВФайлОписанияДанные(ПотокВыгрузкиXML, URIПространстваИмен, ДанныеФайла)
	
	ПакетXDTO = ФабрикаXDTO.Пакеты.Получить(URIПространстваИмен);
	
	wredcDataТип = ПакетXDTO.КорневыеСвойства.Получить("wredcData").Тип;
	Заголовок = ФабрикаXDTO.Создать(wredcDataТип);
	
	Заголовок.id		= Строка(ДанныеФайла.Оригинал.Ссылка.УникальныйИдентификатор());
	Заголовок.created	= ОтформатированнаяДатаДляФайлаОписания(ТекущаяДатаСеанса());
	Заголовок.version	= "1.1";
	
	//ВывестиСодержимоеОписанияФайла(Заголовок, ДанныеФайла);
	//ВывестиПодписиФайлаОписания(Заголовок, ДанныеФайла);   // Пока подписей нет.
	
	ФабрикаXDTO.ЗаписатьXML(ПотокВыгрузкиXML, Заголовок, "wredcData");
	
КонецПроцедуры

Функция ОтформатированнаяДатаДляФайлаОписания(ФорматируемаяДата)
	Возврат Формат(ФорматируемаяДата, "ДФ=гггг-ММ-дд; ДП=");
КонецФункции


&НаКлиенте
Процедура ОтправитьКакЧерновик(Команда)	
	ОтправитьФайл(1);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоМаршруту(Команда)
	ОтправитьФайл(2);
КонецПроцедуры



&НаСервере
Функция ДокументОтправлен(мСсылка)
	мОтправлен = Ложь;
	Если ЗначениеЗаполнено(мСсылка) Тогда 
		мОтправлен = мСсылка.Отправлен;
	КонецЕсли;
	Возврат мОтправлен;
КонецФункции	

&НаСервере
Функция ОпределитьРеквизитыВидаДокумента();
	мРез = Ложь;
	МК_Рекв = Справочники.МК_ВидыДокументов.МК_РеквВидаДокумента(ЭтаФорма.Документ,ЭтаФорма.ПечатнаяФорма);	  // Возвращает соответствие МК_Код, МаршрутПодписания, КодМинтруда, 
	Если МК_Рекв <> Неопределено Тогда   
		Попытка
			мДокумент = ЭтаФорма.ДокументСсылка.ПолучитьОбъект();
			ЭтаФорма.МК_Код = МК_Рекв.Получить("МК_Код");
			//ЭтаФорма.МК_Наименование = МК_Рекв.Получить("МК_Ссылка");
			ЭтаФорма.МК_Наименование = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID",ЭтаФорма.МК_Код);
			ЭтаФорма.МаршрутПодписания = МК_Рекв.Получить("Маршрут");
			ЭтаФорма.КодМинтруда = МК_Рекв.Получить("КодМинтруда");    
			ЭтаФорма.МК_Списочный = МК_Рекв.Получить("Списочный");    
		
			Если ЭтаФорма.МК_Код = "195" Тогда       // 195 - код трудового договора
				ЭтаФорма.НомерДокумента = мДокумент.ТрудовойДоговорНомер;
				ЭтаФорма.ДатаДокумента = мДокумент.ТрудовойДоговорДата;
			Иначе     
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(мДокумент, "НомерПриказа") Тогда
					ЭтаФорма.НомерДокумента = мДокумент.НомерПриказа;
				Иначе	
					ЭтаФорма.НомерДокумента = мДокумент.Номер;
				КонецЕсли;	
				ЭтаФорма.ДатаДокумента = мДокумент.Дата;
			КонецЕсли;
		Исключение	  // В исключение попадают отчеты типа личной карточки Т-2
			ЭтаФорма.ДатаДокумента = ТекущаяДата();                    
			ЭтаФорма.МК_Код = МК_Рекв.Получить("МК_Код");
			//ЭтаФорма.МК_Наименование = МК_Рекв.Получить("МК_Ссылка");
			ЭтаФорма.МК_Наименование = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID",ЭтаФорма.МК_Код);
			ЭтаФорма.МаршрутПодписания = МК_Рекв.Получить("Маршрут");
			ЭтаФорма.КодМинтруда = МК_Рекв.Получить("КодМинтруда");    
		КонецПопытки;		
		мРез = Истина;
	КонецЕсли;	      
	Возврат мРез;
КонецФункции	

&НаКлиенте
Процедура ПодписатьИОтправить(Команда)  
	// Если маршрут подписания "только сотрудник" или "сначала сотрудник", подписание сейчас не нужно	
	Если ЭтаФорма.МаршрутПодписания = ПредопределенноеЗначение("Перечисление.МК_МаршрутыПодписания.М2") Или
	 		ЭтаФорма.МаршрутПодписания = ПредопределенноеЗначение("Перечисление.МК_МаршрутыПодписания.М4") Тогда
		ПоказатьПредупреждение(,"При указанном маршруте подписания документа подпись в настоящий момент не нужна.");
	Иначе
		ОтправитьФайл(3);
	КонецЕсли; 	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиДокКЭДО(мСсылка, МК_Код);	
	мВозврат = Неопределено;
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("мДокОсн",мСсылка);		
	мЗапрос.УстановитьПараметр("мСтатус",Перечисления.МК_СтатусыДокументов.С6);		
	мЗапрос.УстановитьПараметр("мКодДок",МК_Код);		
	мЗапрос.Текст = 
	"ВЫБРАТЬ Первые 1
	|	МК_ДКЭДО.Ссылка КАК Ссылка	
	|ИЗ 
	|	Справочник.МК_ДокументыКЭДО КАК МК_ДКЭДО
	|ГДЕ
	|	НЕ МК_ДКЭДО.ПометкаУдаления 
	|   И НЕ (МК_ДКЭДО.СтатусДокумента = &мСтатус) 
	|   И МК_ДКЭДО.КодТипаДокумента = &мКодДок
	|   И (МК_ДКЭДО.ДокументОснование = &мДокОсн)";
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Если Выборка.Следующий() Тогда
		мВозврат = Выборка.Ссылка;
	КонецЕсли;	
    Возврат мВозврат;	
КонецФункции	

&НаСервере
Процедура ОтправитьНаСервере()   // Попытка отправки ранее сохраненного архива.	
	мВозврат = 1;
	мФайлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ЭтаФорма.ДокКЭДО, мФайлы);    
	Если мФайлы.Количество()>0 Тогда
		ИмяАрхива = мФайлы[0];
	КонецЕсли;	
	//ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(мФайлы[0]);       
	
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	// Тут - отправка. 
	мСеанс = ОО.СоздатьСеансСвязи(Истина);
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не отправляем. 
		мВозврат = 4;		
	Иначе
		мРезультат = ОО.ВыгрузитьФайлНаСайт(ИмяАрхива,мСеанс,"pdf",Истина,"api/1c-exchange/edms/documents/upload","Документы КЭДО");
		Если НЕ мРезультат Тогда
			мВозврат = 5      // Ошибка отправки файла 
		КонецЕсли;		
    КонецЕсли;	
	Если мВозврат = 1 Тогда   // Все удалось. Нужно отправить json описание файла.
		мДокументы = Новый Массив;
		мДокументы.Добавить(ЭтаФорма.ДокКЭДО);
		мРезультат = Справочники.МК_ДокументыКЭДО.МК_ОтправитьJSON(мДокументы);
		Если НЕ мРезультат Тогда
			мВозврат=7; //  Ошибка отправки описания файла.
		КонецЕсли;	
	КонецЕсли;
	Если мВозврат = 1 Тогда
		Сообщить("Документ отправлен успешно");
	ИначеЕсли мВозврат = 5 Тогда
		Сообщить("Ошибка отправки zip-архива");	
	ИначеЕсли мВозврат = 7 Тогда
		Сообщить("Ошибка отправки описания файла");		
	ИначеЕсли мВозврат = 4 Тогда
		Сообщить("Ошибка авторизации. Ничего не отправлено");		
	КонецЕсли;    
	Если мВозврат =1 ИЛИ мВозврат = 5 ИЛИ мВозврат = 7 Тогда  // 5 или 7 - это все сделано, но не удалось отправить zip-архив или описание.
		ЭтаФорма.Состояние = ПолучитьСостояниеДокумента(ЭтаФорма.ДокКЭДО);
		ЭтаФорма.ТолькоПросмотр = Истина;    
		ЭтаФорма.ЗапретДействий = Истина;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();  
	ЭтаФорма.ОбновитьОтображениеДанных(); 
	//ОбновитьДинамическийСписок();
    ОповеститьОбИзменении(ЭтаФорма.ДокументСсылка);
КонецПроцедуры

&НаСервере
Функция УдалитьНаСервере()
	// Надо поменять статус документа на "Недействителен", пометить документ как неотправленный и
	// попытаться отправить сообщение об изменении на сервер. Если получится, снять пометку "неотправлен".	 	
	мДок = ЭтаФорма.ДокКЭДО.ПолучитьОбъект();
	мДок.СтатусДокумента = Перечисления.МК_СтатусыДокументов.С6;   
	мДок.СтатусЧислом = 8;
	мДок.Отправлен = Ложь;
	мДок.Записать();  
	// Отправка
	мРезультат = Истина;
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	мСеанс = ОО.СоздатьСеансСвязи(Истина);
	Если мСеанс = Неопределено Тогда
		// Надо сообщить, что отправка не удалась.  		
	Иначе                         
		мДокс = Новый Массив;
		мДокс.Добавить(СокрЛП(ЭтаФорма.ДокКЭДО.УникальныйИдентификатор())); // Пока один документ отправляем. Хотя можно несколько
		Выгрузка = Новый Структура;
		Выгрузка.Вставить("Documents",мДокс);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		Попытка
			ЗаписатьJSON(ЗаписьJSON, Выгрузка);	
			ТекстJSON = ЗаписьJSON.Закрыть();
		Исключение
			Сообщить(ЗначениеВСтрокуВнутр(Выгрузка));
			ВызватьИсключение(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
				
	hЗапрос = ОО.СоздатьHTTPЗапрос("api/1c-exchange/edms/delete-documents", мСеанс);
	hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
	hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
	hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);
	мОтвет = ОО.ПроверитьОтвет(hОтвет,"ДокументыКЭДО",Истина); 
	Если мОтвет Тогда   // Если отправка случилась успешно, запишем, что документы отправлены.   
		мДок.Отправлен = Истина; 		 
	Иначе
		мДок.Отправлен = Ложь; 
	КонецЕсли;  
	мДок.Записать(); 
	Если мОтвет Тогда
		Сообщить("Состояние документа отправлено успешно");
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	// Сначала вопрос.  	
	Ответ = Неопределено;
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаУдалитьЗавершение", ЭтотОбъект), 
	"Документ будет удален из кабинетов участников, но останется доступен вам. Вы действительно хотите удалить документ КЭДО?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьНаСервере();  
		Если ЭтаФорма.ЗапретДействий Тогда		  
			Элементы.Группа3.Видимость = Ложь;
			Если ДокументОтправлен(ЭтаФорма.ДокКЭДО) Тогда
				Элементы.Отправить.Видимость = Ложь;
			КонецЕсли;
		Иначе
			Элементы.Удалить.Видимость = Ложь;		
			Элементы.Отправить.Видимость = Ложь;		
		КонецЕсли;	
	КонецЕсли;	
	ЭтаФорма.ОбновитьОтображениеДанных(); 
	ОтразитьВРегистре(ЭтаФорма.ДокКЭДО);  
	//ОбновитьДинамическийСписок(); 
	ОповеститьОбИзменении(ЭтаФорма.ДокументСсылка);
КонецПроцедуры    

&НаСервере
Процедура ОтразитьВРегистре(мСсылка) 
	Справочники.МК_ДокументыКЭДО.ОтразитьСостояниеЗаписиВРегистре(ЭтаФорма.ДокКЭДО);
КонецПроцедуры	

//&НаКлиенте
//Процедура ОбновитьДинамическийСписок() 
//	мРез = 1;
//	мВлад = ЭтаФорма.ВладелецФормы;
//	Пока мРез <> 0 Цикл  
//		Если ТипЗнч(мВлад) = Тип("ТаблицаФормы") И мВлад.Имя = "Список" Тогда 
//			мВлад.Обновить(); 
//			мРез = 0;
//		ИначеЕсли ТипЗнч(мВлад) = Тип("ФормаКлиентскогоПриложения") И мВлад.ИмяФормы = "ЖурналДокументов.КадровыеДокументы.Форма.ФормаСписка" Тогда  
//			мВлад.Элементы.Список.Обновить(); 
//			мРез = 0;
//		ИначеЕсли мВлад = Неопределено Тогда
//			Прервать;
//		Иначе	
//			мВлад = мВлад.ВладелецФормы;
//		КонецЕсли; 
//	КонецЦикла;
//КонецПроцедуры

&НаКлиенте
Процедура РуководительПриИзменении(Элемент)   
	ЭтаФорма.РуководительФЛ = ПолучитьФизЛицо(ЭтаФорма.Руководитель);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФизЛицо(мСотр)
	Возврат мСотр.ФизическоеЛицо;
КонецФункции	


&НаКлиенте
Процедура ДокументыСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мАдрес = ЭтаФорма.Элементы.ДокументыСотрудников.ТекущиеДанные.АдресДокумента;
	мТабДок = ПолучитьИзВременногоХранилища(мАдрес);    
	//мТабДок.Показать();
	мПараметры = Новый Структура("ТабДок,Адрес", мТабДок,мАдрес);
	Оп = Неопределено; // Тут нужно оповещение описать
	ОткрытьФорму("Обработка.МК_ОтправкаДокумента.Форма.МК_РедакторТабличногоДокумента",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры
